// 简讯数据  
const newsData = [
  { title:'吐血病', time:'气虚不摄证', summary:'患者2小时前无明显诱因出现吐鲜血，色红，反酸、嗳气、烧心偶作，偶有恶心干呕，无发热，头晕偶作，无心慌胸闷，未进食，无便血，当时未予重视。于今晨6时再次吐鲜血，量约50mL，遂至我院就诊，门诊查"新型冠状病毒核酸试验未见明显异常。胸部CT：右肺中叶陈旧性索条"，遂由门诊收入我科，入院时患者：吐血未作，反酸、嗳气、烧心偶作，偶有恶心干呕，无发热，头晕偶作，无心慌胸闷，未进食，无便血，近期体重无明显下降，舌红苔薄白，脉细弦。'},
  { title:'便血病', time:'气虚不摄证', summary:'患者一个月前无明显诱因出现出现大便发黑，伴上腹部不适，腹部隐痛，大便成形，无里急后重，无粘液附着，纳尚可，未予重视，在市三院予对症输血支持治疗，症状稍缓解，患者仍有头晕、乏力、双下肢无力、颈部及头痛反复发作，今为求进一步治疗遂由家人送至我院，门诊遂拟上消化道出血收入我科进一步诊治。发病来，患者头晕、头痛、乏力、食欲尚可，无发热、黄疸，无吞咽困难，无呕血，无胸闷、咳痰、咯血，无尿少、尿血，食纳、睡眠尚可，近期体重下降。'},
  { title:'便血病', time:'气虚不摄证', summary:'患者四天前无明显诱因出现大便发黑，成形，1-2次/天，无粘液脓血，伴里急后重，排气正常，食欲欠佳，进食量减退，恶心间作，无呕吐、反酸，夜寐欠佳，今为求进一步诊疗，门诊遂拟上消化道出血收入我科进一步诊治。发病来，患者解黑便，成形，无发热、黄疸，无吞咽困难，无胸闷、咳痰、咯血，无尿少、尿血，食纳、睡眠欠佳，小便正常，近期无明显消瘦。'},
  { title:'紫癜病', time:'气虚不摄证', summary:'患者4年前无明显诱因出现皮肤青紫斑点，全身乏力，予徐州市二院就诊，诊断"骨髓增生异常综合征"，予住院治疗，好转后出院，平素予口服"升血小板胶囊、十一酸睾酮软胶囊"等药物、输血支持治疗，3天前患者双下肢皮肤青紫斑点，隐于皮内，压之不褪色，触之不碍手，神疲乏力，头晕头昏时作，心慌时作，气短，动辄为著，无胸闷，无胸痛放射痛，无鼻衄，无齿衄，无尿血，无腹胀腹痛，今为求进一步诊治来我院，病程中患者无恶寒发热、无黄疸，无咳嗽咳痰，无呕血、黑便，纳食一般、睡眠尚可，小便正常，大便造瘘，近期无明显消瘦。'},
  { title:'便血病', time:'气虚不摄证', summary:'患者半年前无明显诱因出现大便发黑，1次/天，成形，无粘液附着，无里急后重，饮食、睡眠尚可，半年来症状反复，无明显好转，未予重视，未系统治疗，今为求进一步治疗遂由家人送至我院，门诊遂拟上消化道出血：糜烂出血性胃炎？收入我科进一步诊治。发病来，患者黑便，上腹部隐痛不适，食欲尚可，无发热、黄疸，无吞咽困难，无胸闷、咳痰、咯血，无尿少、尿血，食纳、睡眠尚可，近期较前略消瘦。'},
  { title:'中风-中经络', time:'气虚血瘀证', summary:'患者2018年5月8日无明显诱因出现头昏伴行走欠稳，当时予徐州市第三人民医院诊断为脑梗塞，经抗聚、调脂、活血化瘀、改善脑功能等治疗好转后出院，2019年7月4日患者因脑梗死再次入院市三院，经抗聚、调脂、活血化瘀、清除氧自由基等治疗后好转，半天前患者无明显诱因症情较前加重，在社区门诊予血塞通及甲钴胺输液治疗，症情改善不明显，现患者为求进一步明确诊疗遂由门诊收住入院，入院时：患者神清，精神欠佳，头昏伴行走欠稳，左下肢乏力，记忆力减退，言语不甚清楚，无头痛，无恶心呕吐，咳嗽偶作，无胸闷、胸痛，无恶寒发热，胃脘嘈杂，无腹痛腹泻，纳寐尚可，小便尚可，大便偏干，舌质淡，苔白，脉弦细。'},
  { title:'心衰病', time:'气虚血瘀证', summary:'患者10余年来反复出现胸闷憋喘不适，多次至我院，自诉查冠脉CT示有50%狭窄（具体不详）。1周前患者不慎受凉后出现咳嗽、咳痰，痰白易咯，胸部疼痛不适，憋喘不适，间断口服感冒治疗，患者症状未见明显改善，现感胸闷憋喘较前加重，遂来我院就诊，现患者胸闷气短，动则益甚，倦怠乏力，声息低微，面色白光白，心慌乏力，胸部疼痛不适，自感呼吸时疼痛加重，咳嗽咳痰，痰白易咯，双下肢轻度浮肿，无腹痛腹泻，纳差，二便正常，夜寐可。'},
  { title:'胸痹心痛病', time:'气虚血瘀证', summary:'患者5年前无明显诱因反复出现胸闷隐痛，诱因不显，休息后可缓解，持续约数分钟至半小时不等，未予重视，半月前患者自觉胸闷隐痛较前加重，连及右侧胁肋，遂至徐州市矿物集团医院就诊，予查心电图提示窦性心动过速，部分导联ST-T改变，予诊断冠心病，因目前病重，未予规范化诊疗，近日患者自觉症状持续较重，遂今日至我院就诊，为进一步治疗收入我科。入院时：患者胸闷隐痛，连及胁肋部，无后背、肩臂放射痛，胃脘嘈杂不适，偶有心慌汗出，畏寒怕冷，手脚冰凉，耳鸣阵作，无头晕头痛，无视物旋转，无黑矇晕厥，纳差，二便尚调，夜寐尚可。'},
  { title:'中风病', time:'气虚血瘀证', summary:'患者约2月前，开始出现双下肢无力，2月中旬，家人送患者至二院就诊，拟脑梗死、糖尿病周围神经病变收治入院，治疗予抗聚、调脂稳定斑块、控制血糖，改善糖尿病周围神经病变，经治稍好转，仍有双下肢无力，双上肢手至腕关节麻木，近1周，患者出现左侧面部麻木发紧感，今为求进一步中西医结合治疗，至我院就诊，门诊排除新冠肺炎，收治入院。入院时，患者神志清楚，精神欠佳，言语稍欠清，双下肢无力，双手及踝部麻木，左侧面部麻木发紧感，偶有咳嗽有痰，纳寐欠佳，大便未解，小便尚调。'},
  { title:'中风病', time:'气虚血瘀证', summary:'2015年无明显诱因，患者突然出现神志不清，呼之不应，至外院查头颅CT示：脑干出血，入重症监护室行保守治疗，昏迷15天，神志逐渐转清，四肢瘫痪，言语不能，多次至外院及我院行康复治疗，遗留头晕间作，言语欠利，行走不稳，肢体平衡功能障碍，共济失调。今日晨起，患者头晕明显，伴有轻微恶心感，站立及行走不能，今为求进一步中西医结合治疗，至我院就诊，收治入院。入院时，患者神志清楚，精神欠佳，头晕间作，体位改变时明显，言语欠利，饮水偶有呛咳，四肢肌力恢复尚可，站立及行走不能，平衡欠佳，纳寐尚可，二便尚调，舌暗红，苔薄白，脉弦涩。'},
  { title:'虚劳病', time:'气虚血瘀证', summary:'患者素嗜肥甘，近半年易发疲乏，近1周明显加重，无明显口干渴，无头晕头痛，偶有心慌、心悸，视物尚可，无明显肢体麻木，纳眠尚可，二便尚调。'},
  { title:'混合痔', time:'湿热下注证', summary:'患者10年前因便秘感会阴部坠胀明显，而致便后肛内肿物脱出，便后用手可还纳，大便带血，未予治疗,症状反复出现,逐渐加重,便后包块不能还纳,1周来症状明显加重，肛门疼痛剧烈，行走不便，便血量多，遂于今日由门诊拟"混合痔嵌顿、脱肛"，收入我区。刻下：无发热咳嗽，便后肛内肿物脱出，不能还纳，持续疼痛，活动受限，肛门坠胀不适,大便排出困难，纳寐欠安。'},
  { title:'混合痔', time:'湿热下注证', summary:'患者1周前因食辛辣醇厚且劳累后出现肛缘肿痛伴肛内肿物脱出,未予治疗，症情反复发作渐加重，偶便血，遂来本院求治。刻下：肛内肿物脱出伴肿缘疼痛，坐卧不宁，行走不利。大便日行1次，质软，排出畅，伴便血，色鲜红，点滴而出，伴排便不尽及肛门坠胀感，无粘液便，小溲畅，无发热恶寒。纳食可，夜寐尚可，舌红，苔黄，脉滑数。'},
  { title:'肛裂', time:'湿热下注证', summary:'患者1周前因食辛辣醇厚且劳累后出现肛缘肿痛伴肛内肿物脱出,未予治疗，症情反复发作渐加重，偶便血，遂来本院求治。刻下：肛内肿物脱出伴肿缘疼痛，坐卧不宁，行走不利。大便日行1次，质软，排出畅，伴便血，色鲜红，点滴而出，伴排便不尽及肛门坠胀感，无粘液便，小溲畅，无发热恶寒。纳食可，夜寐尚可，舌红，苔黄，脉滑数。'},
  { title:'肛肠病（内痔病）', time:'湿热下注证', summary:'患者于入院前1周，出现因食辛辣醇厚且劳累后出现肛旁肿痛，继则破溃伴脓液外溢，未予治疗，症情反复发作渐加重，遂来本院求治。刻下：肛旁肿痛伴脓液外溢，坐卧不宁，行走不利。大便1日/行，日行1次，质软，排出畅，无便血，无排便不尽及肛门坠胀感，无粘液便，小溲畅，无发热恶寒。纳谷不馨，夜寐尚可，舌红，苔白，脉弦滑。'},
  { title:'混合痔', time:'湿热下注证', summary:'患者于入院前3天，出现因食辛辣醇厚且劳累后出现肛缘肿痛伴肛内肿物脱出,伴便血，量多，色鲜红，未予治疗，症情渐加重，遂来本院求治。刻下：肛内肿物脱出伴肿缘疼痛，坐卧不宁，行走不利。大便，日行1次，质软，排出不畅，伴便血，色鲜红，量多，伴排便不尽及肛门坠胀感，无粘液便，小溲畅，无发热恶寒。纳食可，夜寐尚可，舌红，苔黄，脉滑数。'},
  { title:'混合痔', time:'湿热下注证', summary:'患者于入院前1年，出现因食辛辣醇厚且劳累后出现肛缘肿痛伴肛内肿物脱出,未予治疗，症情反复发作渐加重，遂来本院求治。刻下：肛内肿物脱出伴肿缘疼痛，大便日行1次，质软，排出畅，伴便血，点滴而出，色鲜红，无排便不尽及肛门坠胀感，无粘液便，小溲畅，无发热恶寒。纳食可，夜寐尚可，舌红，苔黄，脉滑数。'},
  { title:'血栓性外痔', time:'湿热下注证', summary:'患者于入院前3天，出现因食辛辣醇厚之品出现肛缘皮肤隆起并疼痛,未予治疗，症情反复发作渐加重，遂来本院求治。刻下：肛缘疼痛明显，坐卧不宁，行走不利。大便1日/行，，质软，排出畅，无便血，无排便不尽及肛门坠胀感，无粘液便，小溲畅，无发热恶寒。纳食可，夜寐尚可，舌红，苔黄，脉滑数。'},
  { title:'肛肠病（混合痔病）', time:'湿热下注证', summary:'者10天前无明显诱因下出现肛内肿物外脱，难以回纳，伴便血，血色鲜红，点滴而下，偶呈喷射状，行走不利，坐卧不宁，未予治疗，渐加重，为进一步治疗，逐来我院就诊。刻下：肛周肿物外脱，难以回纳，伴便血，血色鲜红，点滴而下，偶呈喷射状行走不利，坐卧不宁，无肛门坠胀不适，无粘液便，无里急后重感，小溲畅，大便顺排，纳食可，夜寐安和。'},
  { title:'中风病', time:'风痰阻络证', summary:'患者5天前劳累后突然出现头昏头晕，伴有行走欠稳，持续约10秒可自行缓解，无肢体活动不利，无恶心呕吐，无心慌胸痛，无一过性黑曚，遂至徐州二院就诊，查头颅MR示多发性腔隙性脑梗塞。今为求进一步治疗，遂来我院就诊，入院时：患者神志清，精神尚可，头昏头晕间作，伴有行走左偏，无肢体活动不利，无恶心呕吐，无心慌胸痛，无一过性黑曚，无腹痛腹泻，纳寐可，二便尚调。'},
  { title:'中风病', time:'风痰阻络证', summary:'患者6-4日与人争吵后突发头痛，急送至徐州医科大学附属医院，诊断为"多发性脑梗死"，予以改善循环、活血化瘀等治疗后好转出院，遗留左侧肢体无力；为求中西医结合综合治疗，至我院门诊就诊，门诊拟"脑梗死"收治入院。刻下：患者神清，精神欠佳，头痛，偶见头晕，无视物旋转，无黑曚，无恶心、呕吐，言语不清，口角歪斜，无饮水呛咳，无发热、恶寒，饮食可，二便调，夜寐可。舌暗，苔白腻，脉弦。'},
  { title:'中风-中经络', time:'风痰阻络证', summary:'患者有3年前患脑梗塞，遗有肢体无力，行走不稳，在我院治疗，病情好转。3月前患者因受凉出现咳嗽、咳痰，憋喘，心慌、心悸，予治疗后病情有所好转，但仍未痊愈。今因住院周期长，办理出院周转。现患者神清，精神萎靡，反应迟钝，记忆力下降，头晕，头胀，两耳听力下降，肢体活动无力，行走步履不稳，视物模糊，双眼右视时重影，肩背部疼痛时作，咳嗽、气喘。伴有发作性心慌、胸闷、胸痛，双下肢皮肤瘙痒，纳谷一般，饮水不呛，夜寐少，大便一日一次，排气正常，小便频数。'},
  { title:'中风病', time:'风痰阻络证', summary:'患者1月前无明显诱因出现言左上肢麻木无力，未予重视，症状持续无缓解，今日为求中西医结合诊治，来我院门诊，为进一步诊治予收入院。入院时：神清，精神欠佳，言语欠清，左上肢麻木无力，左肩部疼痛，活动受限，无饮水呛咳，左下肢乏力，无头晕、头痛，情绪低落，无胸闷、心慌，食纳可，夜寐安，大小便可，舌紫，苔白，脉弦。'},
  { title:'妊娠腹痛病', time:'肾虚证', summary:'患者月经周期欠规则，30-60日一行，3天净，量少，偶有痛经。LMP：2019-08-13，量色如常，3天净。G2P0。患者因月经错后于10-09至广州华侨医院就诊，查彩超提示：子宫后位，形态增大，实质回声均匀，宫内见一孕囊，形态呈类圆形，内见一早期胚胎，头臀径6.2mm，见心管搏动，见卵黄囊，大小约3.9 * 3.9mm，形态呈圆形，双附件未见占位病变，子宫直肠窝内见液性暗区，提示1.宫内早孕7±周，胚胎存活，2.双附件未见占位性病变。患者近半月余出现下腹疼痛隐隐，现患者为求终止妊娠，遂由门诊"早期人工流产"收入院。刻下：患者神清，精神可，下腹疼痛隐隐，无阴道出血，无明显肛门下坠感，纳可，寐安，二便调畅。舌淡红，苔白，脉弦涩。'},
  { title:'胎动不安病', time:'肾虚证', summary:'患者月经周期规则，28日一行，3天净，量中等，色暗红，有血块，痛经，G4P1，2012年因"计划外妊娠"行"人工流产术"，2011年因"异位妊娠"行"腹腔镜下左侧输卵管切除术"，2018年妊娠2月因"胚停"行"人工流产术"，LMP:2019-01-26，4天净，量色质如常，02-18自测尿HCG（+），今日患者无明显诱因出现下腹隐痛，至我院门诊就诊，查血HCG：197.9mIU/ml、P：24.17ng/ml、E2：135.34ng/ml，现患者为求进一步治疗，门诊收入我科。刻下：患者神清，精神可，阴道无异常出血，腰部酸痛，偶有下腹隐痛，晨起恶心呕吐，纳可，夜寐欠安，二便调，舌淡红，苔薄白，脉沉滑尺脉弱。'},
  { title:'胎死不下病', time:'肾虚证', summary:'患者平素月经周期尚正常，6-7/26-27天，月经量中，轻度痛经，色质尚正常，G1P0；2020年1月于孕60+天检查未见胎心发育于新沂市人民医院行药流+清宫术。LMP：2020-02-01，量色同平素；患者月经结束后未避孕，03月03日患者于家中自测尿HCG阳性，遂至新沂市人民医院查血HCG877.67mIU/ml，后定期复查血HCG值翻倍欠佳，予地屈孕酮片口服及黄体酮针肌注保胎治疗。患者2020-03-28于新沂市妇幼保健院查孕酮18.43ng/ml，血HCG32811.62mIU/ml；2020-04-03于新沂市妇幼保健所复查彩超示：宫内探及妊娠囊回声，大小约27 * 24mm，形态与位置正常，宫内探及妊娠囊回声，大小约27 * 24mm形态与位置正常，囊内探及卵黄囊，似探及胚芽长约3mm，未见心管搏动回声。结合患者血HCG值及彩超，考虑患者胚停可能，因患者有强烈保胎愿望，今日患者来我院复查，查妇科彩超示：宫内见28 * 17 * 29mm孕囊回声，囊内卵黄囊直径约2.7mm、胚芽约2.5mm，未见明显原始心管搏动，孕囊旁见11 * 4mm液性暗区，双侧卵巢大小、形态如常，提示宫内早孕，未见明显原始心管搏动，请结合临床，孕囊旁液性暗区。考虑患者胚胎停止发育，建议患者住院治疗。现患者为求进一步诊治，已由门诊行血常规及胸部CT检查排除新冠肺炎，拟"稽留流产"收住入院。刻下：一般情况可，无恶寒发热，无阴道出血，无腹痛腰酸，纳食可，夜寐安，二便调畅，舌红，苔薄白，脉沉滑尺弱。'},
  { title:'胃脘痛病', time:'脾胃亏虚证', summary:'患者两年前无明显诱因出现上腹疼痛，疼痛以剑下及右上腹为主，呈持续性隐痛，进食后腹胀明显，伴肩背部放射痛，有反酸、嗳气、腹胀及胸骨后烧灼感，恶心，无呕吐，无发热，食欲欠佳，大便日行一次，无粘液脓血，当时未予重视，未行相关检查或治疗。两年间患者上腹疼痛症状间作，期间于我科住院治疗，经"抑酸、保护胃黏膜、消炎、补液对症支持等治疗"后症状好转出院（详见病历397249、417269）。现患者上腹疼痛症状再发，为求进一步诊治，今来我院，由门诊收入我科。入院时患者：上腹疼痛，呈间断性隐痛，无肩背部放射痛，无明显反酸、嗳气及胸骨后烧灼感，腹胀偶作，无恶心呕吐，无发热，无头晕，乏力偶作，食欲差，食纳欠佳，夜寐尚安，小便尚调，大便1-2日一行，无粘液脓血，舌淡红苔薄黄，脉弦。'},
  { title:'胃痞病', time:'脾胃虚弱证', summary:'患者3个月前无明显诱因出现上腹疼痛不适，疼痛以剑下为主，呈持续性隐痛，进食生冷食物后加重、腹泻，泻后痛减，不伴肩背部放射痛，无反酸、嗳气、腹胀及上腹部、胸骨后烧灼感，无恶心呕吐，无畏寒发热，食纳欠佳，大便正常，无粘液脓血，现为求进一步诊治，今来我院，由门诊收入我科。入院时：患者上腹疼痛不适，疼痛以剑下为主，呈持续性隐痛，进食生冷食物后加重、腹泻，泻后痛减，不伴肩背部放射痛，无反酸、嗳气、腹胀及上腹部、胸骨后烧灼感，无恶心呕吐，无畏寒发热，食纳欠佳，大便正常，无粘液脓血，夜寐差，小便正常，近期体重无明显变化。舌质淡，苔薄白，脉细弱。'},
  { title:'胃痞病', time:'脾胃虚弱证', summary:'患者1年前无明显诱因下自觉体重进行性减轻，患者未予重视，后单位体检发现CA724升高，为19.2U/ml，患者未予重视，未行特殊处理。1年来患者体重进行性减轻，2020.08.31体检发现CA724进一步升高，为62.59U/ml，患者自诉无其他特殊不适，无恶心呕吐，无嗳气反酸，无明显腹痛腹胀等，偶有气喘，活动后明显。现为求进一步诊治，今来我院，由门诊收入我科。入院时患者：自觉体重减轻，偶有气喘，活动后明显，无明显腹痛腹胀，无恶心呕吐，无嗳气反酸，无恶心呕吐，无发热，无头晕头痛，无心悸胸闷，食纳可，夜寐安，小便调，大便日行一次，无粘液脓血，近1年体重减轻约5Kg，舌红苔薄黄，脉弦。'},
  { title:'虚劳病', time:'脾胃亏虚证', summary:'患者1年前无明显诱因出现大便次数增多，日行4-5次，量少成形，无粘液，无明显腹痛，无腰背部放射痛，腹胀偶作，便后缓解，无反酸、嗳气及胸骨后烧灼感，无恶心呕吐，无发热，食纳欠佳，夜寐尚安，遂至我院就诊，查电子肠镜：慢性结肠炎；结肠息肉；直肠癌。至我院肛肠科就诊，行"直肠癌手术"，经"抗炎、抑酸保护胃黏膜、补液等支持治疗"后症状好转出院。后至徐州矿总医院行辅助放疗。1年来患者大便次数增多反复发作，后至我院住院治疗，查全腹CT：直肠Ca术后；肝尾状叶囊肿；横结肠局部壁略厚，建议肠镜检查。电子肠镜：慢性结肠炎，直肠术后改变。治疗上予调节肠道菌群，调节胃肠动力，对症支持等治疗后好转出院（详见住院号419529）。1年来患者大便次数增多反复发作，自行予"氟哌酸"口服后症状时有好转。现患者为求进一步诊治，今来我院，由门诊收入我科。入院时患者：大便次数增多，日行4-5次，量少成形，时有大便干结如羊粪，无粘液，无明显腹痛，无腰背部放射痛，腹胀偶作，便后缓解，无反酸、嗳气及胸骨后烧灼感，无恶心呕吐，无发热，食纳欠佳，夜寐尚安，近期体重无明显变化，舌红苔黄，脉细弦。'},
  { title:'眩晕病', time:'痰湿中阻证', summary:'患者于入院前1周无明显诱因，出现头晕、昏沉间作，行走欠利，无视物旋转，现为进一步中西医结合治疗，遂入本院求治，病程中无发热、无意识丧失，无四肢抽搐，无大小便失禁。入院症状：神志清晰，精神欠佳，头晕、昏沉时作，自觉行走欠利，时有右下肢麻木不适、下肢外侧酸痛，心慌胸闷间作，纳食一般，夜寐欠佳，大便如常，小便频，舌淡，苔白，脉弦，嗜好辛辣食物。'},
  { title:'眩晕病', time:'痰湿中阻证', summary:'患者半月余前无明显诱因感头晕时作，改变体位时头晕加重，头痛,右侧枕部为著,颈项部不适,无视物旋转，无恶心呕吐，胸闷不显，心慌阵作，无胸痛放射痛，全身乏力，双下肢为著，今遂至我院门诊就诊，为进一步诊疗收住入院。病程中患者腰部酸痛,左侧肢体麻木，无恶寒发热，无咳嗽咳痰，无夜间憋醒，无晕厥黑朦，无饮水呛咳，纳食可，夜寐一般，二便尚可。舌体胖大，苔黄，脉弦。'},
  { title:'眩晕', time:'痰湿中阻证', summary:'患者于1周前，无明显诱因，夜间起身出现头晕、视物旋转间作，恶心干呕，心慌不适，休息后症状稍改善，仍有头部昏沉、肢体乏力，今日患者症状再发，现为进一步中西医结合治疗，遂入本院求治，病程中无发热、无意识丧失，无四肢抽搐，无大小便失禁。入院症状：患者神志清晰，头晕、昏沉阵发性加重，现无视物旋转，未诉恶心干呕，无耳鸣耳聋，无视物黑曚，纳食一般，夜寐一般，大便如常，小便正常，舌暗淡，苔白腻，脉濡。'},
  { title:'眩晕病', time:'痰湿中阻证', summary:'患者5天前无明显诱因感头晕频作，一过性黑朦伴上肢乏力，无恶心呕吐，胸闷偶作，心慌时作，时有咳嗽，咳白痰，无胸痛、放射痛，全身乏力时作，今遂至我院门诊就诊，为进一步诊疗收住入院。病程中患者无恶寒发热，咳嗽时作，咳白痰，无夜间憋醒，无晕厥，无饮水呛咳，纳食欠佳，夜寐一般，二便尚可。'},
  { title:'痈病', time:'毒邪流窜证', summary:'患者半月前天前右臀部出现一手指甲大小肿物，有一脓头，并感疼痛，曾于某社区医院就诊，予药膏外用（具体不详），近1周来肿物逐渐增至婴儿手掌大小，破溃流脓，疼痛难忍。患者为求进一步治疗，遂来我科住院。门诊查血常规,肺部CT无异常，患者否认近14天湖北疫区及本地发病区接触史，否认近14天新冠肺炎病人接触史，否认近14天接触过来自武汉市及周边或境内、境外疫情严重地区发热有呼吸道症状的患者，否认近14天发热、咳嗽、腹泻，排除新冠肺炎，遂收入院手术治疗，入院时患者无发热不适，无畏寒、寒战，精神及纳食尚可，夜寐安，二便自调。'},
  { title:'蝼蛄疖病', time:'毒邪流窜证', summary:'患者2余年前无明显诱因后枕部出现一黄豆粒大小的脓肿，红肿疼痛，未予重视，头部脓肿渐增多、增大，2018年曾于沛县当地医院就诊，予部分脓肿切开引流术，外用药物及口服抗生素（具体名称不详）治疗，效果一般，症状稍有改善，后仍反复发作，后枕部见大量脓肿，硬币至鸡蛋黄大小，胀痛、压痛明显。为求系统治疗，患者遂至我科住院拟手术治疗。入院时患者无发热不适，精神及饮食可，夜寐一般，二便正常。'},
  { title:'蝼蛄疖病', time:'毒邪流窜证', summary:'患者10天前头皮枕部出现一手指甲大小肿物，有一脓头，并感疼痛，次日肿物增大至半个栗子大小，疼痛加重，其后逐渐增多、增大，相互串通，部分皮损破溃流脓。4天前患者于当地新沂市中医院就诊，予青霉素静滴4日、鱼石脂外用，效果欠佳，脓肿范围继续扩大，疼痛加重，头部胀痛，伴头晕。患者为求进一步治疗，遂来我科住院。入院时患者有发热不适，无畏寒、寒战，精神及纳食尚可，夜寐安，二便自调。'},
  { title:'疖病', time:'毒邪流窜证', summary:'患者8天前右臀部出现一黄豆大小肿物，有一脓头，并感疼痛，次日肿物增大至半个栗子大小，疼痛加重，并新发一枚栗子大小肿物,先后至市立医院、某社区医院就诊，予外用碘伏，静滴克林霉素磷酸酯、左氧氟沙星后皮损基本消退。1天前患者饮酒食驴肉后脓肿范围突然增大，相互串通，部分皮损破溃流脓。患者为求进一步治疗，遂来我科住院。入院时患者有发热不适，无畏寒、寒战，精神及纳食尚可，夜寐安，二便自调。'}
 ];
    
  // 更新简讯列表的函数  
function updateNewsList() {  
  const newsList = document.getElementById('news-list');  
  const newsContainer = document.getElementById('news-container'); // 假设这是包含新闻列表的容器  
  
  newsList.innerHTML = ''; // 清空旧的简讯内容  
  
  
  
  newsData.forEach(news => {  
    const li = document.createElement('li');  
    li.innerHTML = `  
      <h3 class="news-title">${news.title}</h3>  
      <p class="news-info">${news.time}</p>  
      <p class="news-info">${news.summary}</p>  
    `;  
    newsList.appendChild(li);  
  }); 

  // 滚动到最新添加的新闻项  
  scrollToLatestNews(newsContainer);  
}  

  // 滚动到最新新闻的函数  
  function scrollToLatestNews(container) {  
    const latestNews = container.querySelector('li:last-child');  
    if (!latestNews) return; // 如果没有最新新闻，直接返回  

    const scrollDuration = 10000; // 滚动总时长
    const scrollStep = 1; // 每次滚动的步长  
    const start = container.scrollTop;  
    const end = latestNews.offsetTop - container.offsetTop; // 要滚动到的目标位置  
    const totalNewsHeight = Array.from(newsList.children).reduce((sum, li) => sum + li.offsetHeight, 0);  
    const containerHeight = container.offsetHeight;  
    let isContinuousScroll = false; // 标记是否连续滚动  
    
    function step(currentTime) {  
      const timeElapsed = currentTime - startTime;  
      const progress = Math.min(timeElapsed / scrollDuration, 1);  
      const scrollPosition = start + (end - start) * progress;  
      container.scrollTop = scrollPosition;  
    
      if (timeElapsed < scrollDuration) {  
        window.requestAnimationFrame(step);  
      } else {  
        container.scrollTop = end; // 确保最终滚动到位  
          
        // 检查是否应该连续滚动  
        if (container.scrollTop + containerHeight >= totalNewsHeight) {  
          isContinuousScroll = true;  
          container.scrollTop = 0; // 滚动到第一个新闻项  
        }  
    
        // 如果需要连续滚动，则重新调用滚动函数  
        if (isContinuousScroll) {  
          setTimeout(() => {  
            scrollToLatestNews(container); // 递归调用
          }); 
        }  
      }  
    }  
    
    window.requestAnimationFrame(step);  
  }  
    
  // 初始化简讯列表  
  updateNewsList();
  